GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 03A87h
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: CCDCON
#define CCDCON CCDCON
CCDCON                                   equ 03ABEh
// bitfield definitions
CCDCON_DS_POSN                           equ 0000h
CCDCON_DS_POSITION                       equ 0000h
CCDCON_DS_SIZE                           equ 0002h
CCDCON_DS_LENGTH                         equ 0002h
CCDCON_DS_MASK                           equ 0003h
CCDCON_EN_POSN                           equ 0007h
CCDCON_EN_POSITION                       equ 0007h
CCDCON_EN_SIZE                           equ 0001h
CCDCON_EN_LENGTH                         equ 0001h
CCDCON_EN_MASK                           equ 0080h
CCDCON_CCDS_POSN                         equ 0000h
CCDCON_CCDS_POSITION                     equ 0000h
CCDCON_CCDS_SIZE                         equ 0002h
CCDCON_CCDS_LENGTH                       equ 0002h
CCDCON_CCDS_MASK                         equ 0003h
CCDCON_CCDEN_POSN                        equ 0007h
CCDCON_CCDEN_POSITION                    equ 0007h
CCDCON_CCDEN_SIZE                        equ 0001h
CCDCON_CCDEN_LENGTH                      equ 0001h
CCDCON_CCDEN_MASK                        equ 0080h
CCDCON_SEL0_POSN                         equ 0000h
CCDCON_SEL0_POSITION                     equ 0000h
CCDCON_SEL0_SIZE                         equ 0001h
CCDCON_SEL0_LENGTH                       equ 0001h
CCDCON_SEL0_MASK                         equ 0001h
CCDCON_SEL1_POSN                         equ 0001h
CCDCON_SEL1_POSITION                     equ 0001h
CCDCON_SEL1_SIZE                         equ 0001h
CCDCON_SEL1_LENGTH                       equ 0001h
CCDCON_SEL1_MASK                         equ 0002h

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
PPSLOCK                                  equ 03ABFh
// bitfield definitions
PPSLOCK_PPSLOCKED_POSN                   equ 0000h
PPSLOCK_PPSLOCKED_POSITION               equ 0000h
PPSLOCK_PPSLOCKED_SIZE                   equ 0001h
PPSLOCK_PPSLOCKED_LENGTH                 equ 0001h
PPSLOCK_PPSLOCKED_MASK                   equ 0001h

// Register: INT0PPS
#define INT0PPS INT0PPS
INT0PPS                                  equ 03AC0h
// bitfield definitions
INT0PPS_INT0PPS_POSN                     equ 0000h
INT0PPS_INT0PPS_POSITION                 equ 0000h
INT0PPS_INT0PPS_SIZE                     equ 0005h
INT0PPS_INT0PPS_LENGTH                   equ 0005h
INT0PPS_INT0PPS_MASK                     equ 001Fh

// Register: INT1PPS
#define INT1PPS INT1PPS
INT1PPS                                  equ 03AC1h
// bitfield definitions
INT1PPS_INT1PPS_POSN                     equ 0000h
INT1PPS_INT1PPS_POSITION                 equ 0000h
INT1PPS_INT1PPS_SIZE                     equ 0005h
INT1PPS_INT1PPS_LENGTH                   equ 0005h
INT1PPS_INT1PPS_MASK                     equ 001Fh

// Register: INT2PPS
#define INT2PPS INT2PPS
INT2PPS                                  equ 03AC2h
// bitfield definitions
INT2PPS_INT2PPS_POSN                     equ 0000h
INT2PPS_INT2PPS_POSITION                 equ 0000h
INT2PPS_INT2PPS_SIZE                     equ 0005h
INT2PPS_INT2PPS_LENGTH                   equ 0005h
INT2PPS_INT2PPS_MASK                     equ 001Fh

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 03AC3h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 03AC4h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 03AC5h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh

// Register: T3CKIPPS
#define T3CKIPPS T3CKIPPS
T3CKIPPS                                 equ 03AC6h
// bitfield definitions
T3CKIPPS_T3CKIPPS_POSN                   equ 0000h
T3CKIPPS_T3CKIPPS_POSITION               equ 0000h
T3CKIPPS_T3CKIPPS_SIZE                   equ 0005h
T3CKIPPS_T3CKIPPS_LENGTH                 equ 0005h
T3CKIPPS_T3CKIPPS_MASK                   equ 001Fh

// Register: T3GPPS
#define T3GPPS T3GPPS
T3GPPS                                   equ 03AC7h
// bitfield definitions
T3GPPS_T3GPPS_POSN                       equ 0000h
T3GPPS_T3GPPS_POSITION                   equ 0000h
T3GPPS_T3GPPS_SIZE                       equ 0005h
T3GPPS_T3GPPS_LENGTH                     equ 0005h
T3GPPS_T3GPPS_MASK                       equ 001Fh

// Register: T5CKIPPS
#define T5CKIPPS T5CKIPPS
T5CKIPPS                                 equ 03AC8h
// bitfield definitions
T5CKIPPS_T5CKIPPS_POSN                   equ 0000h
T5CKIPPS_T5CKIPPS_POSITION               equ 0000h
T5CKIPPS_T5CKIPPS_SIZE                   equ 0005h
T5CKIPPS_T5CKIPPS_LENGTH                 equ 0005h
T5CKIPPS_T5CKIPPS_MASK                   equ 001Fh

// Register: T5GPPS
#define T5GPPS T5GPPS
T5GPPS                                   equ 03AC9h
// bitfield definitions
T5GPPS_T5GPPS_POSN                       equ 0000h
T5GPPS_T5GPPS_POSITION                   equ 0000h
T5GPPS_T5GPPS_SIZE                       equ 0005h
T5GPPS_T5GPPS_LENGTH                     equ 0005h
T5GPPS_T5GPPS_MASK                       equ 001Fh

