GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.inc
// Register: T2INPPS
#define T2INPPS T2INPPS
T2INPPS                                  equ 03ACAh
// bitfield definitions
T2INPPS_T2INPPS_POSN                     equ 0000h
T2INPPS_T2INPPS_POSITION                 equ 0000h
T2INPPS_T2INPPS_SIZE                     equ 0005h
T2INPPS_T2INPPS_LENGTH                   equ 0005h
T2INPPS_T2INPPS_MASK                     equ 001Fh

// Register: T4INPPS
#define T4INPPS T4INPPS
T4INPPS                                  equ 03ACBh
// bitfield definitions
T4INPPS_T4INPPS_POSN                     equ 0000h
T4INPPS_T4INPPS_POSITION                 equ 0000h
T4INPPS_T4INPPS_SIZE                     equ 0005h
T4INPPS_T4INPPS_LENGTH                   equ 0005h
T4INPPS_T4INPPS_MASK                     equ 001Fh

// Register: T6INPPS
#define T6INPPS T6INPPS
T6INPPS                                  equ 03ACCh
// bitfield definitions
T6INPPS_T6INPPS_POSN                     equ 0000h
T6INPPS_T6INPPS_POSITION                 equ 0000h
T6INPPS_T6INPPS_SIZE                     equ 0005h
T6INPPS_T6INPPS_LENGTH                   equ 0005h
T6INPPS_T6INPPS_MASK                     equ 001Fh

// Register: CCP1PPS
#define CCP1PPS CCP1PPS
CCP1PPS                                  equ 03ACDh
// bitfield definitions
CCP1PPS_CCP1PPS_POSN                     equ 0000h
CCP1PPS_CCP1PPS_POSITION                 equ 0000h
CCP1PPS_CCP1PPS_SIZE                     equ 0005h
CCP1PPS_CCP1PPS_LENGTH                   equ 0005h
CCP1PPS_CCP1PPS_MASK                     equ 001Fh

// Register: CCP2PPS
#define CCP2PPS CCP2PPS
CCP2PPS                                  equ 03ACEh
// bitfield definitions
CCP2PPS_CCP2PPS_POSN                     equ 0000h
CCP2PPS_CCP2PPS_POSITION                 equ 0000h
CCP2PPS_CCP2PPS_SIZE                     equ 0005h
CCP2PPS_CCP2PPS_LENGTH                   equ 0005h
CCP2PPS_CCP2PPS_MASK                     equ 001Fh

// Register: CCP3PPS
#define CCP3PPS CCP3PPS
CCP3PPS                                  equ 03ACFh
// bitfield definitions
CCP3PPS_CCP3PPS_POSN                     equ 0000h
CCP3PPS_CCP3PPS_POSITION                 equ 0000h
CCP3PPS_CCP3PPS_SIZE                     equ 0005h
CCP3PPS_CCP3PPS_LENGTH                   equ 0005h
CCP3PPS_CCP3PPS_MASK                     equ 001Fh

// Register: CCP4PPS
#define CCP4PPS CCP4PPS
CCP4PPS                                  equ 03AD0h
// bitfield definitions
CCP4PPS_CCP4PPS_POSN                     equ 0000h
CCP4PPS_CCP4PPS_POSITION                 equ 0000h
CCP4PPS_CCP4PPS_SIZE                     equ 0005h
CCP4PPS_CCP4PPS_LENGTH                   equ 0005h
CCP4PPS_CCP4PPS_MASK                     equ 001Fh

// Register: SMT1WINPPS
#define SMT1WINPPS SMT1WINPPS
SMT1WINPPS                               equ 03AD1h
// bitfield definitions
SMT1WINPPS_SMT1WINPPS_POSN               equ 0000h
SMT1WINPPS_SMT1WINPPS_POSITION           equ 0000h
SMT1WINPPS_SMT1WINPPS_SIZE               equ 0005h
SMT1WINPPS_SMT1WINPPS_LENGTH             equ 0005h
SMT1WINPPS_SMT1WINPPS_MASK               equ 001Fh

// Register: SMT1SIGPPS
#define SMT1SIGPPS SMT1SIGPPS
SMT1SIGPPS                               equ 03AD2h
// bitfield definitions
SMT1SIGPPS_SMT1SIGPPS_POSN               equ 0000h
SMT1SIGPPS_SMT1SIGPPS_POSITION           equ 0000h
SMT1SIGPPS_SMT1SIGPPS_SIZE               equ 0005h
SMT1SIGPPS_SMT1SIGPPS_LENGTH             equ 0005h
SMT1SIGPPS_SMT1SIGPPS_MASK               equ 001Fh

// Register: CWG1INPPS
#define CWG1INPPS CWG1INPPS
CWG1INPPS                                equ 03AD3h
// bitfield definitions
CWG1INPPS_CWG1INPPS_POSN                 equ 0000h
CWG1INPPS_CWG1INPPS_POSITION             equ 0000h
CWG1INPPS_CWG1INPPS_SIZE                 equ 0005h
CWG1INPPS_CWG1INPPS_LENGTH               equ 0005h
CWG1INPPS_CWG1INPPS_MASK                 equ 001Fh

// Register: CWG2INPPS
#define CWG2INPPS CWG2INPPS
CWG2INPPS                                equ 03AD4h
// bitfield definitions
CWG2INPPS_CWG2INPPS_POSN                 equ 0000h
CWG2INPPS_CWG2INPPS_POSITION             equ 0000h
CWG2INPPS_CWG2INPPS_SIZE                 equ 0005h
CWG2INPPS_CWG2INPPS_LENGTH               equ 0005h
CWG2INPPS_CWG2INPPS_MASK                 equ 001Fh

// Register: CWG3INPPS
#define CWG3INPPS CWG3INPPS
CWG3INPPS                                equ 03AD5h
// bitfield definitions
CWG3INPPS_CWG3INPPS_POSN                 equ 0000h
CWG3INPPS_CWG3INPPS_POSITION             equ 0000h
CWG3INPPS_CWG3INPPS_SIZE                 equ 0005h
CWG3INPPS_CWG3INPPS_LENGTH               equ 0005h
CWG3INPPS_CWG3INPPS_MASK                 equ 001Fh

// Register: MD1CARLPPS
#define MD1CARLPPS MD1CARLPPS
MD1CARLPPS                               equ 03AD6h
// bitfield definitions
MD1CARLPPS_MD1CARLPPS_POSN               equ 0000h
MD1CARLPPS_MD1CARLPPS_POSITION           equ 0000h
MD1CARLPPS_MD1CARLPPS_SIZE               equ 0005h
MD1CARLPPS_MD1CARLPPS_LENGTH             equ 0005h
MD1CARLPPS_MD1CARLPPS_MASK               equ 001Fh

// Register: MD1CARHPPS
#define MD1CARHPPS MD1CARHPPS
MD1CARHPPS                               equ 03AD7h
// bitfield definitions
MD1CARHPPS_MD1CARHPPS_POSN               equ 0000h
MD1CARHPPS_MD1CARHPPS_POSITION           equ 0000h
MD1CARHPPS_MD1CARHPPS_SIZE               equ 0005h
MD1CARHPPS_MD1CARHPPS_LENGTH             equ 0005h
MD1CARHPPS_MD1CARHPPS_MASK               equ 001Fh

// Register: MD1SRCPPS
#define MD1SRCPPS MD1SRCPPS
MD1SRCPPS                                equ 03AD8h
// bitfield definitions
MD1SRCPPS_MD1SRCPPS_POSN                 equ 0000h
MD1SRCPPS_MD1SRCPPS_POSITION             equ 0000h
MD1SRCPPS_MD1SRCPPS_SIZE                 equ 0005h
MD1SRCPPS_MD1SRCPPS_LENGTH               equ 0005h
MD1SRCPPS_MD1SRCPPS_MASK                 equ 001Fh

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 03AD9h
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0005h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0005h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 001Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 03ADAh
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0005h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0005h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 001Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 03ADBh
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0005h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0005h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 001Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 03ADCh
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0005h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0005h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 001Fh

// Register: ADACTPPS
#define ADACTPPS ADACTPPS
ADACTPPS                                 equ 03ADDh
// bitfield definitions
ADACTPPS_ADACTPPS_POSN                   equ 0000h
ADACTPPS_ADACTPPS_POSITION               equ 0000h
ADACTPPS_ADACTPPS_SIZE                   equ 0005h
ADACTPPS_ADACTPPS_LENGTH                 equ 0005h
ADACTPPS_ADACTPPS_MASK                   equ 001Fh

// Register: SPI1SCKPPS
#define SPI1SCKPPS SPI1SCKPPS
SPI1SCKPPS                               equ 03ADEh
// bitfield definitions
SPI1SCKPPS_SPI1SCKPPS_POSN               equ 0000h
SPI1SCKPPS_SPI1SCKPPS_POSITION           equ 0000h
SPI1SCKPPS_SPI1SCKPPS_SIZE               equ 0005h
SPI1SCKPPS_SPI1SCKPPS_LENGTH             equ 0005h
SPI1SCKPPS_SPI1SCKPPS_MASK               equ 001Fh

