GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.inc
// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
SPI1SDIPPS                               equ 03ADFh
// bitfield definitions
SPI1SDIPPS_SPI1SDIPPS_POSN               equ 0000h
SPI1SDIPPS_SPI1SDIPPS_POSITION           equ 0000h
SPI1SDIPPS_SPI1SDIPPS_SIZE               equ 0005h
SPI1SDIPPS_SPI1SDIPPS_LENGTH             equ 0005h
SPI1SDIPPS_SPI1SDIPPS_MASK               equ 001Fh

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
SPI1SSPPS                                equ 03AE0h
// bitfield definitions
SPI1SSPPS_SPI1SSPPS_POSN                 equ 0000h
SPI1SSPPS_SPI1SSPPS_POSITION             equ 0000h
SPI1SSPPS_SPI1SSPPS_SIZE                 equ 0005h
SPI1SSPPS_SPI1SSPPS_LENGTH               equ 0005h
SPI1SSPPS_SPI1SSPPS_MASK                 equ 001Fh

// Register: I2C1SCLPPS
#define I2C1SCLPPS I2C1SCLPPS
I2C1SCLPPS                               equ 03AE1h
// bitfield definitions
I2C1SCLPPS_I2C1SCLPPS_POSN               equ 0000h
I2C1SCLPPS_I2C1SCLPPS_POSITION           equ 0000h
I2C1SCLPPS_I2C1SCLPPS_SIZE               equ 0005h
I2C1SCLPPS_I2C1SCLPPS_LENGTH             equ 0005h
I2C1SCLPPS_I2C1SCLPPS_MASK               equ 001Fh

// Register: I2C1SDAPPS
#define I2C1SDAPPS I2C1SDAPPS
I2C1SDAPPS                               equ 03AE2h
// bitfield definitions
I2C1SDAPPS_I2C1SDAPPS_POSN               equ 0000h
I2C1SDAPPS_I2C1SDAPPS_POSITION           equ 0000h
I2C1SDAPPS_I2C1SDAPPS_SIZE               equ 0005h
I2C1SDAPPS_I2C1SDAPPS_LENGTH             equ 0005h
I2C1SDAPPS_I2C1SDAPPS_MASK               equ 001Fh

// Register: I2C2SCLPPS
#define I2C2SCLPPS I2C2SCLPPS
I2C2SCLPPS                               equ 03AE3h
// bitfield definitions
I2C2SCLPPS_I2C2SCLPPS_POSN               equ 0000h
I2C2SCLPPS_I2C2SCLPPS_POSITION           equ 0000h
I2C2SCLPPS_I2C2SCLPPS_SIZE               equ 0005h
I2C2SCLPPS_I2C2SCLPPS_LENGTH             equ 0005h
I2C2SCLPPS_I2C2SCLPPS_MASK               equ 001Fh

// Register: I2C2SDAPPS
#define I2C2SDAPPS I2C2SDAPPS
I2C2SDAPPS                               equ 03AE4h
// bitfield definitions
I2C2SDAPPS_I2C2SDAPPS_POSN               equ 0000h
I2C2SDAPPS_I2C2SDAPPS_POSITION           equ 0000h
I2C2SDAPPS_I2C2SDAPPS_SIZE               equ 0005h
I2C2SDAPPS_I2C2SDAPPS_LENGTH             equ 0005h
I2C2SDAPPS_I2C2SDAPPS_MASK               equ 001Fh

// Register: U1RXPPS
#define U1RXPPS U1RXPPS
U1RXPPS                                  equ 03AE5h
// bitfield definitions
U1RXPPS_U1RXPPS_POSN                     equ 0000h
U1RXPPS_U1RXPPS_POSITION                 equ 0000h
U1RXPPS_U1RXPPS_SIZE                     equ 0005h
U1RXPPS_U1RXPPS_LENGTH                   equ 0005h
U1RXPPS_U1RXPPS_MASK                     equ 001Fh

// Register: U1CTSPPS
#define U1CTSPPS U1CTSPPS
U1CTSPPS                                 equ 03AE6h
// bitfield definitions
U1CTSPPS_U1CTSPPS_POSN                   equ 0000h
U1CTSPPS_U1CTSPPS_POSITION               equ 0000h
U1CTSPPS_U1CTSPPS_SIZE                   equ 0005h
U1CTSPPS_U1CTSPPS_LENGTH                 equ 0005h
U1CTSPPS_U1CTSPPS_MASK                   equ 001Fh

// Register: U2RXPPS
#define U2RXPPS U2RXPPS
U2RXPPS                                  equ 03AE8h
// bitfield definitions
U2RXPPS_U2RXPPS_POSN                     equ 0000h
U2RXPPS_U2RXPPS_POSITION                 equ 0000h
U2RXPPS_U2RXPPS_SIZE                     equ 0005h
U2RXPPS_U2RXPPS_LENGTH                   equ 0005h
U2RXPPS_U2RXPPS_MASK                     equ 001Fh

// Register: U2CTSPPS
#define U2CTSPPS U2CTSPPS
U2CTSPPS                                 equ 03AE9h
// bitfield definitions
U2CTSPPS_U2CTSPPS_POSN                   equ 0000h
U2CTSPPS_U2CTSPPS_POSITION               equ 0000h
U2CTSPPS_U2CTSPPS_SIZE                   equ 0005h
U2CTSPPS_U2CTSPPS_LENGTH                 equ 0005h
U2CTSPPS_U2CTSPPS_MASK                   equ 001Fh

// Register: DMA2BUF
#define DMA2BUF DMA2BUF
DMA2BUF                                  equ 03BC9h
// bitfield definitions
DMA2BUF_BUF_POSN                         equ 0000h
DMA2BUF_BUF_POSITION                     equ 0000h
DMA2BUF_BUF_SIZE                         equ 0008h
DMA2BUF_BUF_LENGTH                       equ 0008h
DMA2BUF_BUF_MASK                         equ 00FFh
DMA2BUF_BUF0_POSN                        equ 0000h
DMA2BUF_BUF0_POSITION                    equ 0000h
DMA2BUF_BUF0_SIZE                        equ 0001h
DMA2BUF_BUF0_LENGTH                      equ 0001h
DMA2BUF_BUF0_MASK                        equ 0001h
DMA2BUF_BUF1_POSN                        equ 0001h
DMA2BUF_BUF1_POSITION                    equ 0001h
DMA2BUF_BUF1_SIZE                        equ 0001h
DMA2BUF_BUF1_LENGTH                      equ 0001h
DMA2BUF_BUF1_MASK                        equ 0002h
DMA2BUF_BUF2_POSN                        equ 0002h
DMA2BUF_BUF2_POSITION                    equ 0002h
DMA2BUF_BUF2_SIZE                        equ 0001h
DMA2BUF_BUF2_LENGTH                      equ 0001h
DMA2BUF_BUF2_MASK                        equ 0004h
DMA2BUF_BUF3_POSN                        equ 0003h
DMA2BUF_BUF3_POSITION                    equ 0003h
DMA2BUF_BUF3_SIZE                        equ 0001h
DMA2BUF_BUF3_LENGTH                      equ 0001h
DMA2BUF_BUF3_MASK                        equ 0008h
DMA2BUF_BUF4_POSN                        equ 0004h
DMA2BUF_BUF4_POSITION                    equ 0004h
DMA2BUF_BUF4_SIZE                        equ 0001h
DMA2BUF_BUF4_LENGTH                      equ 0001h
DMA2BUF_BUF4_MASK                        equ 0010h
DMA2BUF_BUF5_POSN                        equ 0005h
DMA2BUF_BUF5_POSITION                    equ 0005h
DMA2BUF_BUF5_SIZE                        equ 0001h
DMA2BUF_BUF5_LENGTH                      equ 0001h
DMA2BUF_BUF5_MASK                        equ 0020h
DMA2BUF_BUF6_POSN                        equ 0006h
DMA2BUF_BUF6_POSITION                    equ 0006h
DMA2BUF_BUF6_SIZE                        equ 0001h
DMA2BUF_BUF6_LENGTH                      equ 0001h
DMA2BUF_BUF6_MASK                        equ 0040h
DMA2BUF_BUF7_POSN                        equ 0007h
DMA2BUF_BUF7_POSITION                    equ 0007h
DMA2BUF_BUF7_SIZE                        equ 0001h
DMA2BUF_BUF7_LENGTH                      equ 0001h
DMA2BUF_BUF7_MASK                        equ 0080h
DMA2BUF_DMA2BUF_POSN                     equ 0000h
DMA2BUF_DMA2BUF_POSITION                 equ 0000h
DMA2BUF_DMA2BUF_SIZE                     equ 0008h
DMA2BUF_DMA2BUF_LENGTH                   equ 0008h
DMA2BUF_DMA2BUF_MASK                     equ 00FFh
DMA2BUF_DMA2BUF0_POSN                    equ 0000h
DMA2BUF_DMA2BUF0_POSITION                equ 0000h
DMA2BUF_DMA2BUF0_SIZE                    equ 0001h
DMA2BUF_DMA2BUF0_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF0_MASK                    equ 0001h
DMA2BUF_DMA2BUF1_POSN                    equ 0001h
DMA2BUF_DMA2BUF1_POSITION                equ 0001h
DMA2BUF_DMA2BUF1_SIZE                    equ 0001h
DMA2BUF_DMA2BUF1_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF1_MASK                    equ 0002h
DMA2BUF_DMA2BUF2_POSN                    equ 0002h
DMA2BUF_DMA2BUF2_POSITION                equ 0002h
DMA2BUF_DMA2BUF2_SIZE                    equ 0001h
DMA2BUF_DMA2BUF2_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF2_MASK                    equ 0004h
DMA2BUF_DMA2BUF3_POSN                    equ 0003h
DMA2BUF_DMA2BUF3_POSITION                equ 0003h
DMA2BUF_DMA2BUF3_SIZE                    equ 0001h
DMA2BUF_DMA2BUF3_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF3_MASK                    equ 0008h
DMA2BUF_DMA2BUF4_POSN                    equ 0004h
DMA2BUF_DMA2BUF4_POSITION                equ 0004h
DMA2BUF_DMA2BUF4_SIZE                    equ 0001h
DMA2BUF_DMA2BUF4_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF4_MASK                    equ 0010h
DMA2BUF_DMA2BUF5_POSN                    equ 0005h
DMA2BUF_DMA2BUF5_POSITION                equ 0005h
DMA2BUF_DMA2BUF5_SIZE                    equ 0001h
DMA2BUF_DMA2BUF5_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF5_MASK                    equ 0020h
DMA2BUF_DMA2BUF6_POSN                    equ 0006h
DMA2BUF_DMA2BUF6_POSITION                equ 0006h
DMA2BUF_DMA2BUF6_SIZE                    equ 0001h
DMA2BUF_DMA2BUF6_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF6_MASK                    equ 0040h
DMA2BUF_DMA2BUF7_POSN                    equ 0007h
DMA2BUF_DMA2BUF7_POSITION                equ 0007h
DMA2BUF_DMA2BUF7_SIZE                    equ 0001h
DMA2BUF_DMA2BUF7_LENGTH                  equ 0001h
DMA2BUF_DMA2BUF7_MASK                    equ 0080h

