GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.inc
#define ANSELA7                          BANKMASK(ANSELA), 7, b
#define ANSELB0                          BANKMASK(ANSELB), 0, b
#define ANSELB1                          BANKMASK(ANSELB), 1, b
#define ANSELB2                          BANKMASK(ANSELB), 2, b
#define ANSELB3                          BANKMASK(ANSELB), 3, b
#define ANSELB4                          BANKMASK(ANSELB), 4, b
#define ANSELB5                          BANKMASK(ANSELB), 5, b
#define ANSELB6                          BANKMASK(ANSELB), 6, b
#define ANSELB7                          BANKMASK(ANSELB), 7, b
#define ANSELC0                          BANKMASK(ANSELC), 0, b
#define ANSELC1                          BANKMASK(ANSELC), 1, b
#define ANSELC2                          BANKMASK(ANSELC), 2, b
#define ANSELC3                          BANKMASK(ANSELC), 3, b
#define ANSELC4                          BANKMASK(ANSELC), 4, b
#define ANSELC5                          BANKMASK(ANSELC), 5, b
#define ANSELC6                          BANKMASK(ANSELC), 6, b
#define ANSELC7                          BANKMASK(ANSELC), 7, b
#define AS                               BANKMASK(SMT1STAT), 0, b
#define ASYNC                            BANKMASK(T0CON1), 4, a
#define BASE0                            BANKMASK(IVTBASEL), 0, a
#define BASE1                            BANKMASK(IVTBASEL), 1, a
#define BASE10                           BANKMASK(IVTBASEH), 2, a
#define BASE11                           BANKMASK(IVTBASEH), 3, a
#define BASE12                           BANKMASK(IVTBASEH), 4, a
#define BASE13                           BANKMASK(IVTBASEH), 5, a
#define BASE14                           BANKMASK(IVTBASEH), 6, a
#define BASE15                           BANKMASK(IVTBASEH), 7, a
#define BASE16                           BANKMASK(IVTBASEU), 0, a
#define BASE17                           BANKMASK(IVTBASEU), 1, a
#define BASE18                           BANKMASK(IVTBASEU), 2, a
#define BASE19                           BANKMASK(IVTBASEU), 3, a
#define BASE2                            BANKMASK(IVTBASEL), 2, a
#define BASE20                           BANKMASK(IVTBASEU), 4, a
#define BASE3                            BANKMASK(IVTBASEL), 3, a
#define BASE4                            BANKMASK(IVTBASEL), 4, a
#define BASE5                            BANKMASK(IVTBASEL), 5, a
#define BASE6                            BANKMASK(IVTBASEL), 6, a
#define BASE7                            BANKMASK(IVTBASEL), 7, a
#define BASE8                            BANKMASK(IVTBASEH), 0, a
#define BASE9                            BANKMASK(IVTBASEH), 1, a
#define BAUD0                            BANKMASK(SPI1BAUD), 0, b
#define BAUD1                            BANKMASK(SPI1BAUD), 1, b
#define BAUD2                            BANKMASK(SPI1BAUD), 2, b
#define BAUD3                            BANKMASK(SPI1BAUD), 3, b
#define BAUD4                            BANKMASK(SPI1BAUD), 4, b
#define BAUD5                            BANKMASK(SPI1BAUD), 5, b
#define BAUD6                            BANKMASK(SPI1BAUD), 6, b
#define BAUD7                            BANKMASK(SPI1BAUD), 7, b
#define BCL1IE                           BANKMASK(I2C1ERR), 1, b
#define BCL1IF                           BANKMASK(I2C1ERR), 5, b
#define BCL2IE                           BANKMASK(I2C2ERR), 1, b
#define BCL2IF                           BANKMASK(I2C2ERR), 5, b
#define BMODE                            BANKMASK(SPI1CON0), 0, b
#define BOR                              BANKMASK(PCON0), 0, a
#define BORRDY                           BANKMASK(BORCON), 0, b
#define BTO1IE                           BANKMASK(I2C1ERR), 2, b
#define BTO1IF                           BANKMASK(I2C1ERR), 6, b
#define BTO2IE                           BANKMASK(I2C2ERR), 2, b
#define BTO2IF                           BANKMASK(I2C2ERR), 6, b
#define BURSTMD                          BANKMASK(SCANCON0), 1, b
#define C0EN                             BANKMASK(U1CON2), 3, b
#define C1EN                             BANKMASK(CM1CON0), 7, b
#define C1HYS                            BANKMASK(CM1CON0), 1, b
#define C1IE                             BANKMASK(PIE1), 4, b
#define C1IF                             BANKMASK(PIR1), 4, b
#define C1INTN                           BANKMASK(CM1CON1), 0, b
#define C1INTP                           BANKMASK(CM1CON1), 1, b
#define C1IP                             BANKMASK(IPR1), 4, b
#define C1NCH0                           BANKMASK(CM1NCH), 0, b
#define C1NCH1                           BANKMASK(CM1NCH), 1, b
#define C1NCH2                           BANKMASK(CM1NCH), 2, b
#define C1PCH0                           BANKMASK(CM1PCH), 0, b
#define C1PCH1                           BANKMASK(CM1PCH), 1, b
#define C1PCH2                           BANKMASK(CM1PCH), 2, b
#define C1POL                            BANKMASK(CM1CON0), 4, b
#define C1SYNC                           BANKMASK(CM1CON0), 0, b
#define C1TSEL0                          BANKMASK(CCPTMRS0), 0, b
#define C1TSEL1                          BANKMASK(CCPTMRS0), 1, b
#define C2EN                             BANKMASK(CM2CON0), 7, b
#define C2HYS                            BANKMASK(CM2CON0), 1, b
#define C2IE                             BANKMASK(PIE5), 1, b
#define C2IF                             BANKMASK(PIR5), 1, b
#define C2INTN                           BANKMASK(CM2CON1), 0, b
#define C2INTP                           BANKMASK(CM2CON1), 1, b
#define C2IP                             BANKMASK(IPR5), 1, b
#define C2NCH0                           BANKMASK(CM2NCH), 0, b
#define C2NCH1                           BANKMASK(CM2NCH), 1, b
#define C2NCH2                           BANKMASK(CM2NCH), 2, b
#define C2PCH0                           BANKMASK(CM2PCH), 0, b
#define C2PCH1                           BANKMASK(CM2PCH), 1, b
#define C2PCH2                           BANKMASK(CM2PCH), 2, b
#define C2POL                            BANKMASK(CM2CON0), 4, b
#define C2SYNC                           BANKMASK(CM2CON0), 0, b
#define C2TSEL0                          BANKMASK(CCPTMRS0), 2, b
#define C2TSEL1                          BANKMASK(CCPTMRS0), 3, b
#define C3TSEL0                          BANKMASK(CCPTMRS0), 4, b
#define C3TSEL1                          BANKMASK(CCPTMRS0), 5, b
#define C4TSEL0                          BANKMASK(CCPTMRS0), 6, b
#define C4TSEL1                          BANKMASK(CCPTMRS0), 7, b
#define CALC0                            BANKMASK(ADCON3), 4, b
#define CALC1                            BANKMASK(ADCON3), 5, b
#define CALC2                            BANKMASK(ADCON3), 6, b
#define CAP0                             BANKMASK(ADCAP), 0, b
#define CAP1                             BANKMASK(ADCAP), 1, b
#define CAP2                             BANKMASK(ADCAP), 2, b
#define CAP3                             BANKMASK(ADCAP), 3, b
#define CAP4                             BANKMASK(ADCAP), 4, b
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCDEN                            BANKMASK(CCDCON), 7, b
#define CCDNA0                           BANKMASK(CCDNA), 0, b
#define CCDNA1                           BANKMASK(CCDNA), 1, b
#define CCDNA2                           BANKMASK(CCDNA), 2, b
#define CCDNA3                           BANKMASK(CCDNA), 3, b
#define CCDNA4                           BANKMASK(CCDNA), 4, b
#define CCDNA5                           BANKMASK(CCDNA), 5, b
#define CCDNA6                           BANKMASK(CCDNA), 6, b
#define CCDNA7                           BANKMASK(CCDNA), 7, b
#define CCDNB0                           BANKMASK(CCDNB), 0, b
#define CCDNB1                           BANKMASK(CCDNB), 1, b
#define CCDNB2                           BANKMASK(CCDNB), 2, b
#define CCDNB3                           BANKMASK(CCDNB), 3, b
#define CCDNB4                           BANKMASK(CCDNB), 4, b
#define CCDNB5                           BANKMASK(CCDNB), 5, b
#define CCDNB6                           BANKMASK(CCDNB), 6, b
#define CCDNB7                           BANKMASK(CCDNB), 7, b
#define CCDNC0                           BANKMASK(CCDNC), 0, b
#define CCDNC1                           BANKMASK(CCDNC), 1, b
#define CCDNC2                           BANKMASK(CCDNC), 2, b
#define CCDNC3                           BANKMASK(CCDNC), 3, b
#define CCDNC4                           BANKMASK(CCDNC), 4, b
#define CCDNC5                           BANKMASK(CCDNC), 5, b
#define CCDNC6                           BANKMASK(CCDNC), 6, b
#define CCDNC7                           BANKMASK(CCDNC), 7, b
#define CCDPA0                           BANKMASK(CCDPA), 0, b
#define CCDPA1                           BANKMASK(CCDPA), 1, b
#define CCDPA2                           BANKMASK(CCDPA), 2, b
#define CCDPA3                           BANKMASK(CCDPA), 3, b
#define CCDPA4                           BANKMASK(CCDPA), 4, b
#define CCDPA5                           BANKMASK(CCDPA), 5, b
#define CCDPA6                           BANKMASK(CCDPA), 6, b
#define CCDPA7                           BANKMASK(CCDPA), 7, b
#define CCDPB0                           BANKMASK(CCDPB), 0, b
#define CCDPB1                           BANKMASK(CCDPB), 1, b
#define CCDPB2                           BANKMASK(CCDPB), 2, b
#define CCDPB3                           BANKMASK(CCDPB), 3, b
#define CCDPB4                           BANKMASK(CCDPB), 4, b
#define CCDPB5                           BANKMASK(CCDPB), 5, b
#define CCDPB6                           BANKMASK(CCDPB), 6, b
#define CCDPB7                           BANKMASK(CCDPB), 7, b
#define CCDPC0                           BANKMASK(CCDPC), 0, b
#define CCDPC1                           BANKMASK(CCDPC), 1, b
#define CCDPC2                           BANKMASK(CCDPC), 2, b
#define CCDPC3                           BANKMASK(CCDPC), 3, b
#define CCDPC4                           BANKMASK(CCDPC), 4, b
#define CCDPC5                           BANKMASK(CCDPC), 5, b
#define CCDPC6                           BANKMASK(CCDPC), 6, b
#define CCDPC7                           BANKMASK(CCDPC), 7, b
#define CCP1CTS0                         BANKMASK(CCP1CAP), 0, a
#define CCP1CTS1                         BANKMASK(CCP1CAP), 1, a
#define CCP1CTS2                         BANKMASK(CCP1CAP), 2, a
#define CCP1EN                           BANKMASK(CCP1CON), 7, a
#define CCP1FMT                          BANKMASK(CCP1CON), 4, a
#define CCP1IE                           BANKMASK(PIE4), 3, b
#define CCP1IF                           BANKMASK(PIR4), 3, b
#define CCP1IP                           BANKMASK(IPR4), 3, b
#define CCP1MD                           BANKMASK(PMD3), 0, b
#define CCP1MODE0                        BANKMASK(CCP1CON), 0, a
#define CCP1MODE1                        BANKMASK(CCP1CON), 1, a
#define CCP1MODE2                        BANKMASK(CCP1CON), 2, a
#define CCP1MODE3                        BANKMASK(CCP1CON), 3, a
#define CCP1OUT                          BANKMASK(CCP1CON), 5, a
#define CCP2CTS0                         BANKMASK(CCP2CAP), 0, a
#define CCP2CTS1                         BANKMASK(CCP2CAP), 1, a
#define CCP2CTS2                         BANKMASK(CCP2CAP), 2, a
#define CCP2EN                           BANKMASK(CCP2CON), 7, a
#define CCP2FMT                          BANKMASK(CCP2CON), 4, a
#define CCP2IE                           BANKMASK(PIE7), 1, b
#define CCP2IF                           BANKMASK(PIR7), 1, b
#define CCP2IP                           BANKMASK(IPR7), 1, b
#define CCP2MD                           BANKMASK(PMD3), 1, b
#define CCP2MODE0                        BANKMASK(CCP2CON), 0, a
#define CCP2MODE1                        BANKMASK(CCP2CON), 1, a
#define CCP2MODE2                        BANKMASK(CCP2CON), 2, a
#define CCP2MODE3                        BANKMASK(CCP2CON), 3, a
#define CCP2OUT                          BANKMASK(CCP2CON), 5, a
#define CCP3CTS0                         BANKMASK(CCP3CAP), 0, a
#define CCP3CTS1                         BANKMASK(CCP3CAP), 1, a
#define CCP3CTS2                         BANKMASK(CCP3CAP), 2, a
#define CCP3EN                           BANKMASK(CCP3CON), 7, a
#define CCP3FMT                          BANKMASK(CCP3CON), 4, a
#define CCP3IE                           BANKMASK(PIE9), 1, b
#define CCP3IF                           BANKMASK(PIR9), 1, b
#define CCP3IP                           BANKMASK(IPR9), 1, b
#define CCP3MD                           BANKMASK(PMD3), 2, b
#define CCP3MODE0                        BANKMASK(CCP3CON), 0, a
#define CCP3MODE1                        BANKMASK(CCP3CON), 1, a
#define CCP3MODE2                        BANKMASK(CCP3CON), 2, a
#define CCP3MODE3                        BANKMASK(CCP3CON), 3, a
#define CCP3OUT                          BANKMASK(CCP3CON), 5, a
#define CCP4CTS0                         BANKMASK(CCP4CAP), 0, a
#define CCP4CTS1                         BANKMASK(CCP4CAP), 1, a
#define CCP4CTS2                         BANKMASK(CCP4CAP), 2, a
#define CCP4EN                           BANKMASK(CCP4CON), 7, a
#define CCP4FMT                          BANKMASK(CCP4CON), 4, a
#define CCP4IE                           BANKMASK(PIE10), 0, b
#define CCP4IF                           BANKMASK(PIR10), 0, b
#define CCP4IP                           BANKMASK(IPR10), 0, b
#define CCP4MD                           BANKMASK(PMD3), 3, b
#define CCP4MODE0                        BANKMASK(CCP4CON), 0, a
#define CCP4MODE1                        BANKMASK(CCP4CON), 1, a
#define CCP4MODE2                        BANKMASK(CCP4CON), 2, a
#define CCP4MODE3                        BANKMASK(CCP4CON), 3, a
#define CCP4OUT                          BANKMASK(CCP4CON), 5, a
#define CDAFVR0                          BANKMASK(FVRCON), 2, b
#define CDAFVR1                          BANKMASK(FVRCON), 3, b
#define CDIV0                            BANKMASK(OSCCON2), 0, b
#define CDIV1                            BANKMASK(OSCCON2), 1, b
#define CDIV2                            BANKMASK(OSCCON2), 2, b
#define CDIV3                            BANKMASK(OSCCON2), 3, b
#define CH0                              BANKMASK(MD1CARH), 0, b
#define CH1                              BANKMASK(MD1CARH), 1, b
#define CH2                              BANKMASK(MD1CARH), 2, b
#define CH3                              BANKMASK(MD1CARH), 3, b
#define CH4                              BANKMASK(MD1CARH), 4, b
#define CHPOL                            BANKMASK(MD1CON1), 5, b
#define CHSYNC                           BANKMASK(MD1CON1), 4, b
#define CKE                              BANKMASK(SPI1CON1), 6, b
#define CKP                              BANKMASK(SPI1CON1), 5, b
#define CKPS3                            BANKMASK(T0CON1), 3, a
#define CKS0                             BANKMASK(NCO1CLK), 0, b
#define CKS1                             BANKMASK(NCO1CLK), 1, b
#define CKS2                             BANKMASK(NCO1CLK), 2, b
#define CKS3                             BANKMASK(NCO1CLK), 3, b
#define CL0                              BANKMASK(MD1CARL), 0, b
#define CL1                              BANKMASK(MD1CARL), 1, b
#define CL2                              BANKMASK(MD1CARL), 2, b
#define CL3                              BANKMASK(MD1CARL), 3, b
#define CL4                              BANKMASK(MD1CARL), 4, b
#define CLC1IE                           BANKMASK(PIE4), 7, b
#define CLC1IF                           BANKMASK(PIR4), 7, b
#define CLC1IP                           BANKMASK(IPR4), 7, b
#define CLC1MD                           BANKMASK(PMD6), 1, b
#define CLC1OUT                          BANKMASK(CLCDATA0), 0, b
#define CLC2IE                           BANKMASK(PIE7), 4, b
#define CLC2IF                           BANKMASK(PIR7), 4, b
#define CLC2IP                           BANKMASK(IPR7), 4, b
#define CLC2MD                           BANKMASK(PMD6), 2, b
#define CLC2OUT                          BANKMASK(CLCDATA0), 1, b
#define CLC3IE                           BANKMASK(PIE9), 3, b
#define CLC3IF                           BANKMASK(PIR9), 3, b
#define CLC3IP                           BANKMASK(IPR9), 3, b
#define CLC3MD                           BANKMASK(PMD6), 3, b
#define CLC3OUT                          BANKMASK(CLCDATA0), 2, b
#define CLC4IE                           BANKMASK(PIE10), 1, b
#define CLC4IF                           BANKMASK(PIR10), 1, b
#define CLC4IP                           BANKMASK(IPR10), 1, b
#define CLC4MD                           BANKMASK(PMD6), 4, b
#define CLC4OUT                          BANKMASK(CLCDATA0), 3, b
#define CLKRCLK0                         BANKMASK(CLKRCLK), 0, b
#define CLKRCLK1                         BANKMASK(CLKRCLK), 1, b
#define CLKRCLK2                         BANKMASK(CLKRCLK), 2, b
#define CLKRCLK3                         BANKMASK(CLKRCLK), 3, b
#define CLKRDC0                          BANKMASK(CLKRCON), 3, b
#define CLKRDC1                          BANKMASK(CLKRCON), 4, b
#define CLKRDIV0                         BANKMASK(CLKRCON), 0, b
#define CLKRDIV1                         BANKMASK(CLKRCON), 1, b
#define CLKRDIV2                         BANKMASK(CLKRCON), 2, b
#define CLKREN                           BANKMASK(CLKRCON), 7, b
#define CLKRMD                           BANKMASK(PMD0), 1, b
#define CLKSEL0                          BANKMASK(SPI1CLK), 0, b
#define CLKSEL1                          BANKMASK(SPI1CLK), 1, b
#define CLKSEL2                          BANKMASK(SPI1CLK), 2, b
#define CLKSEL3                          BANKMASK(SPI1CLK), 3, b
#define CLPOL                            BANKMASK(MD1CON1), 1, b
#define CLSYNC                           BANKMASK(MD1CON1), 0, b
#define CMP1MD                           BANKMASK(PMD2), 1, b
#define CMP2MD                           BANKMASK(PMD2), 2, b
#define CNT1IE                           BANKMASK(I2C1PIE), 7, b
#define CNT1IF                           BANKMASK(I2C1PIR), 7, b
#define CNT2IE                           BANKMASK(I2C2PIE), 7, b
#define CNT2IF                           BANKMASK(I2C2PIR), 7, b
#define CONT                             BANKMASK(ADCON0), 6, b
#define COSC0                            BANKMASK(OSCCON2), 4, b
#define COSC1                            BANKMASK(OSCCON2), 5, b
#define COSC2                            BANKMASK(OSCCON2), 6, b
#define CPOL                             BANKMASK(SMT1CON0), 2, b
#define CPON                             BANKMASK(ADCP), 7, b
#define CPR0                             BANKMASK(SMT1CPRL), 0, b
#define CPR1                             BANKMASK(SMT1CPRL), 1, b
#define CPR10                            BANKMASK(SMT1CPRH), 2, b
#define CPR11                            BANKMASK(SMT1CPRH), 3, b
#define CPR12                            BANKMASK(SMT1CPRH), 4, b
#define CPR13                            BANKMASK(SMT1CPRH), 5, b
#define CPR14                            BANKMASK(SMT1CPRH), 6, b
#define CPR15                            BANKMASK(SMT1CPRH), 7, b
#define CPR16                            BANKMASK(SMT1CPRU), 0, b
#define CPR17                            BANKMASK(SMT1CPRU), 1, b
#define CPR18                            BANKMASK(SMT1CPRU), 2, b
#define CPR19                            BANKMASK(SMT1CPRU), 3, b
#define CPR2                             BANKMASK(SMT1CPRL), 2, b
#define CPR20                            BANKMASK(SMT1CPRU), 4, b
#define CPR21                            BANKMASK(SMT1CPRU), 5, b
#define CPR22                            BANKMASK(SMT1CPRU), 6, b
#define CPR23                            BANKMASK(SMT1CPRU), 7, b
#define CPR3                             BANKMASK(SMT1CPRL), 3, b
#define CPR4                             BANKMASK(SMT1CPRL), 4, b
#define CPR5                             BANKMASK(SMT1CPRL), 5, b
#define CPR6                             BANKMASK(SMT1CPRL), 6, b
#define CPR7                             BANKMASK(SMT1CPRL), 7, b
#define CPR8                             BANKMASK(SMT1CPRH), 0, b
#define CPR9                             BANKMASK(SMT1CPRH), 1, b
#define CPRDY                            BANKMASK(ADCP), 0, b
#define CPRUP                            BANKMASK(SMT1STAT), 7, b
#define CPW0                             BANKMASK(SMT1CPWL), 0, b
#define CPW1                             BANKMASK(SMT1CPWL), 1, b
#define CPW10                            BANKMASK(SMT1CPWH), 2, b
#define CPW11                            BANKMASK(SMT1CPWH), 3, b
#define CPW12                            BANKMASK(SMT1CPWH), 4, b
#define CPW13                            BANKMASK(SMT1CPWH), 5, b
#define CPW14                            BANKMASK(SMT1CPWH), 6, b
#define CPW15                            BANKMASK(SMT1CPWH), 7, b
#define CPW16                            BANKMASK(SMT1CPWU), 0, b
#define CPW17                            BANKMASK(SMT1CPWU), 1, b
#define CPW18                            BANKMASK(SMT1CPWU), 2, b
#define CPW19                            BANKMASK(SMT1CPWU), 3, b
#define CPW2                             BANKMASK(SMT1CPWL), 2, b
#define CPW20                            BANKMASK(SMT1CPWU), 4, b
#define CPW21                            BANKMASK(SMT1CPWU), 5, b
#define CPW22                            BANKMASK(SMT1CPWU), 6, b
#define CPW23                            BANKMASK(SMT1CPWU), 7, b
#define CPW3                             BANKMASK(SMT1CPWL), 3, b
#define CPW4                             BANKMASK(SMT1CPWL), 4, b
#define CPW5                             BANKMASK(SMT1CPWL), 5, b
#define CPW6                             BANKMASK(SMT1CPWL), 6, b
#define CPW7                             BANKMASK(SMT1CPWL), 7, b
#define CPW8                             BANKMASK(SMT1CPWH), 0, b
#define CPW9                             BANKMASK(SMT1CPWH), 1, b
#define CPWUP                            BANKMASK(SMT1STAT), 6, b
#define CRCEN                            BANKMASK(CRCCON0), 7, b
#define CRCGO                            BANKMASK(CRCCON0), 6, b
#define CRCIE                            BANKMASK(PIE0), 6, b
#define CRCIF                            BANKMASK(PIR0), 6, b
#define CRCIP                            BANKMASK(IPR0), 6, b
#define CRCMD                            BANKMASK(PMD0), 4, b
#define CRS0                             BANKMASK(ADCON2), 4, b
#define CRS1                             BANKMASK(ADCON2), 5, b
#define CRS2                             BANKMASK(ADCON2), 6, b
#define CS5                              BANKMASK(ADCLK), 5, b
#define CSEL0                            BANKMASK(SMT1CLK), 0, b
#define CSEL1                            BANKMASK(SMT1CLK), 1, b
#define CSEL2                            BANKMASK(SMT1CLK), 2, b
#define CSWHOLD                          BANKMASK(OSCCON3), 7, b
#define CSWIE                            BANKMASK(PIE0), 3, b
#define CSWIF                            BANKMASK(PIR0), 3, b
#define CSWIP                            BANKMASK(IPR0), 3, b
#define CWG1CS                           BANKMASK(CWG1CLK), 0, b
#define CWG1DBF0                         BANKMASK(CWG1DBF), 0, b
#define CWG1DBF1                         BANKMASK(CWG1DBF), 1, b
#define CWG1DBF2                         BANKMASK(CWG1DBF), 2, b
#define CWG1DBF3                         BANKMASK(CWG1DBF), 3, b
#define CWG1DBF4                         BANKMASK(CWG1DBF), 4, b
#define CWG1DBF5                         BANKMASK(CWG1DBF), 5, b
#define CWG1DBR0                         BANKMASK(CWG1DBR), 0, b
#define CWG1DBR1                         BANKMASK(CWG1DBR), 1, b
#define CWG1DBR2                         BANKMASK(CWG1DBR), 2, b
#define CWG1DBR3                         BANKMASK(CWG1DBR), 3, b
#define CWG1DBR4                         BANKMASK(CWG1DBR), 4, b
#define CWG1DBR5                         BANKMASK(CWG1DBR), 5, b
#define CWG1EN                           BANKMASK(CWG1CON0), 7, b
#define CWG1IE                           BANKMASK(PIE4), 6, b
#define CWG1IF                           BANKMASK(PIR4), 6, b
#define CWG1IN                           BANKMASK(CWG1CON1), 5, b
