GopalSaraf/Practicals/PSDL/include/proc/pic18lf25k42.inc
#define DMA2DSA10                        BANKMASK(DMA2DSAH), 2, b
#define DMA2DSA11                        BANKMASK(DMA2DSAH), 3, b
#define DMA2DSA12                        BANKMASK(DMA2DSAH), 4, b
#define DMA2DSA13                        BANKMASK(DMA2DSAH), 5, b
#define DMA2DSA14                        BANKMASK(DMA2DSAH), 6, b
#define DMA2DSA15                        BANKMASK(DMA2DSAH), 7, b
#define DMA2DSA2                         BANKMASK(DMA2DSAL), 2, b
#define DMA2DSA3                         BANKMASK(DMA2DSAL), 3, b
#define DMA2DSA4                         BANKMASK(DMA2DSAL), 4, b
#define DMA2DSA5                         BANKMASK(DMA2DSAL), 5, b
#define DMA2DSA6                         BANKMASK(DMA2DSAL), 6, b
#define DMA2DSA7                         BANKMASK(DMA2DSAL), 7, b
#define DMA2DSA8                         BANKMASK(DMA2DSAH), 0, b
#define DMA2DSA9                         BANKMASK(DMA2DSAH), 1, b
#define DMA2DSZ0                         BANKMASK(DMA2DSZL), 0, b
#define DMA2DSZ1                         BANKMASK(DMA2DSZL), 1, b
#define DMA2DSZ10                        BANKMASK(DMA2DSZH), 2, b
#define DMA2DSZ11                        BANKMASK(DMA2DSZH), 3, b
#define DMA2DSZ2                         BANKMASK(DMA2DSZL), 2, b
#define DMA2DSZ3                         BANKMASK(DMA2DSZL), 3, b
#define DMA2DSZ4                         BANKMASK(DMA2DSZL), 4, b
#define DMA2DSZ5                         BANKMASK(DMA2DSZL), 5, b
#define DMA2DSZ6                         BANKMASK(DMA2DSZL), 6, b
#define DMA2DSZ7                         BANKMASK(DMA2DSZL), 7, b
#define DMA2DSZ8                         BANKMASK(DMA2DSZH), 0, b
#define DMA2DSZ9                         BANKMASK(DMA2DSZH), 1, b
#define DMA2EN                           BANKMASK(DMA2CON0), 7, b
#define DMA2MD                           BANKMASK(PMD7), 1, b
#define DMA2ORIE                         BANKMASK(PIE5), 4, b
#define DMA2ORIF                         BANKMASK(PIR5), 4, b
#define DMA2ORIP                         BANKMASK(IPR5), 4, b
#define DMA2PR0                          BANKMASK(DMA2PR), 0, b
#define DMA2PR1                          BANKMASK(DMA2PR), 1, b
#define DMA2PR2                          BANKMASK(DMA2PR), 2, b
#define DMA2SCNT0                        BANKMASK(DMA2SCNTL), 0, b
#define DMA2SCNT1                        BANKMASK(DMA2SCNTL), 1, b
#define DMA2SCNT10                       BANKMASK(DMA2SCNTH), 2, b
#define DMA2SCNT11                       BANKMASK(DMA2SCNTH), 3, b
#define DMA2SCNT2                        BANKMASK(DMA2SCNTL), 2, b
#define DMA2SCNT3                        BANKMASK(DMA2SCNTL), 3, b
#define DMA2SCNT4                        BANKMASK(DMA2SCNTL), 4, b
#define DMA2SCNT5                        BANKMASK(DMA2SCNTL), 5, b
#define DMA2SCNT6                        BANKMASK(DMA2SCNTL), 6, b
#define DMA2SCNT7                        BANKMASK(DMA2SCNTL), 7, b
#define DMA2SCNT8                        BANKMASK(DMA2SCNTH), 0, b
#define DMA2SCNT9                        BANKMASK(DMA2SCNTH), 1, b
#define DMA2SCNTIE                       BANKMASK(PIE5), 2, b
#define DMA2SCNTIF                       BANKMASK(PIR5), 2, b
#define DMA2SCNTIP                       BANKMASK(IPR5), 2, b
#define DMA2SIRQ0                        BANKMASK(DMA2SIRQ), 0, b
#define DMA2SIRQ1                        BANKMASK(DMA2SIRQ), 1, b
#define DMA2SIRQ2                        BANKMASK(DMA2SIRQ), 2, b
#define DMA2SIRQ3                        BANKMASK(DMA2SIRQ), 3, b
#define DMA2SIRQ4                        BANKMASK(DMA2SIRQ), 4, b
#define DMA2SIRQ5                        BANKMASK(DMA2SIRQ), 5, b
#define DMA2SIRQ6                        BANKMASK(DMA2SIRQ), 6, b
#define DMA2SIRQEN                       BANKMASK(DMA2CON0), 6, b
#define DMA2SPTR0                        BANKMASK(DMA2SPTRL), 0, b
#define DMA2SPTR1                        BANKMASK(DMA2SPTRL), 1, b
#define DMA2SPTR10                       BANKMASK(DMA2SPTRH), 2, b
#define DMA2SPTR11                       BANKMASK(DMA2SPTRH), 3, b
#define DMA2SPTR12                       BANKMASK(DMA2SPTRH), 4, b
#define DMA2SPTR13                       BANKMASK(DMA2SPTRH), 5, b
#define DMA2SPTR14                       BANKMASK(DMA2SPTRH), 6, b
#define DMA2SPTR15                       BANKMASK(DMA2SPTRH), 7, b
#define DMA2SPTR16                       BANKMASK(DMA2SPTRU), 0, b
#define DMA2SPTR17                       BANKMASK(DMA2SPTRU), 1, b
#define DMA2SPTR18                       BANKMASK(DMA2SPTRU), 2, b
#define DMA2SPTR19                       BANKMASK(DMA2SPTRU), 3, b
#define DMA2SPTR2                        BANKMASK(DMA2SPTRL), 2, b
#define DMA2SPTR20                       BANKMASK(DMA2SPTRU), 4, b
#define DMA2SPTR21                       BANKMASK(DMA2SPTRU), 5, b
#define DMA2SPTR3                        BANKMASK(DMA2SPTRL), 3, b
#define DMA2SPTR4                        BANKMASK(DMA2SPTRL), 4, b
#define DMA2SPTR5                        BANKMASK(DMA2SPTRL), 5, b
#define DMA2SPTR6                        BANKMASK(DMA2SPTRL), 6, b
#define DMA2SPTR7                        BANKMASK(DMA2SPTRL), 7, b
#define DMA2SPTR8                        BANKMASK(DMA2SPTRH), 0, b
#define DMA2SPTR9                        BANKMASK(DMA2SPTRH), 1, b
#define DMA2SSA0                         BANKMASK(DMA2SSAL), 0, b
#define DMA2SSA1                         BANKMASK(DMA2SSAL), 1, b
#define DMA2SSA10                        BANKMASK(DMA2SSAH), 2, b
#define DMA2SSA11                        BANKMASK(DMA2SSAH), 3, b
#define DMA2SSA12                        BANKMASK(DMA2SSAH), 4, b
#define DMA2SSA13                        BANKMASK(DMA2SSAH), 5, b
#define DMA2SSA14                        BANKMASK(DMA2SSAH), 6, b
#define DMA2SSA15                        BANKMASK(DMA2SSAH), 7, b
#define DMA2SSA16                        BANKMASK(DMA2SSAU), 0, b
#define DMA2SSA17                        BANKMASK(DMA2SSAU), 1, b
#define DMA2SSA18                        BANKMASK(DMA2SSAU), 2, b
#define DMA2SSA19                        BANKMASK(DMA2SSAU), 3, b
#define DMA2SSA2                         BANKMASK(DMA2SSAL), 2, b
#define DMA2SSA20                        BANKMASK(DMA2SSAU), 4, b
#define DMA2SSA21                        BANKMASK(DMA2SSAU), 5, b
#define DMA2SSA3                         BANKMASK(DMA2SSAL), 3, b
#define DMA2SSA4                         BANKMASK(DMA2SSAL), 4, b
#define DMA2SSA5                         BANKMASK(DMA2SSAL), 5, b
#define DMA2SSA6                         BANKMASK(DMA2SSAL), 6, b
#define DMA2SSA7                         BANKMASK(DMA2SSAL), 7, b
#define DMA2SSA8                         BANKMASK(DMA2SSAH), 0, b
#define DMA2SSA9                         BANKMASK(DMA2SSAH), 1, b
#define DMA2SSZ0                         BANKMASK(DMA2SSZL), 0, b
#define DMA2SSZ1                         BANKMASK(DMA2SSZL), 1, b
#define DMA2SSZ10                        BANKMASK(DMA2SSZH), 2, b
#define DMA2SSZ11                        BANKMASK(DMA2SSZH), 3, b
#define DMA2SSZ2                         BANKMASK(DMA2SSZL), 2, b
#define DMA2SSZ3                         BANKMASK(DMA2SSZL), 3, b
#define DMA2SSZ4                         BANKMASK(DMA2SSZL), 4, b
#define DMA2SSZ5                         BANKMASK(DMA2SSZL), 5, b
#define DMA2SSZ6                         BANKMASK(DMA2SSZL), 6, b
#define DMA2SSZ7                         BANKMASK(DMA2SSZL), 7, b
#define DMA2SSZ8                         BANKMASK(DMA2SSZH), 0, b
#define DMA2SSZ9                         BANKMASK(DMA2SSZH), 1, b
#define DMA2XIP                          BANKMASK(DMA2CON0), 0, b
#define DOE                              BANKMASK(CPUDOZE), 4, b
#define DONE                             BANKMASK(ADCON0), 0, b
#define DOZE0                            BANKMASK(CPUDOZE), 0, b
#define DOZE1                            BANKMASK(CPUDOZE), 1, b
#define DOZE2                            BANKMASK(CPUDOZE), 2, b
#define DOZEN                            BANKMASK(CPUDOZE), 6, b
#define DSEN                             BANKMASK(ADCON1), 0, b
#define DSMMD                            BANKMASK(PMD6), 0, b
#define EOSIE                            BANKMASK(SPI1INTE), 4, b
#define EOSIF                            BANKMASK(SPI1INTF), 4, b
#define ERR0                             BANKMASK(ADERRL), 0, b
#define ERR1                             BANKMASK(ADERRL), 1, b
#define ERR10                            BANKMASK(ADERRH), 2, b
#define ERR11                            BANKMASK(ADERRH), 3, b
#define ERR12                            BANKMASK(ADERRH), 4, b
#define ERR13                            BANKMASK(ADERRH), 5, b
#define ERR14                            BANKMASK(ADERRH), 6, b
#define ERR15                            BANKMASK(ADERRH), 7, b
#define ERR2                             BANKMASK(ADERRL), 2, b
#define ERR3                             BANKMASK(ADERRL), 3, b
#define ERR4                             BANKMASK(ADERRL), 4, b
#define ERR5                             BANKMASK(ADERRL), 5, b
#define ERR6                             BANKMASK(ADERRL), 6, b
#define ERR7                             BANKMASK(ADERRL), 7, b
#define ERR8                             BANKMASK(ADERRH), 0, b
#define ERR9                             BANKMASK(ADERRH), 1, b
#define EXTOEN                           BANKMASK(OSCEN), 7, b
#define EXTOR                            BANKMASK(OSCSTAT), 7, b
#define FLTR0                            BANKMASK(ADFLTRL), 0, b
#define FLTR1                            BANKMASK(ADFLTRL), 1, b
#define FLTR10                           BANKMASK(ADFLTRH), 2, b
#define FLTR11                           BANKMASK(ADFLTRH), 3, b
#define FLTR12                           BANKMASK(ADFLTRH), 4, b
#define FLTR13                           BANKMASK(ADFLTRH), 5, b
#define FLTR14                           BANKMASK(ADFLTRH), 6, b
#define FLTR15                           BANKMASK(ADFLTRH), 7, b
#define FLTR2                            BANKMASK(ADFLTRL), 2, b
#define FLTR3                            BANKMASK(ADFLTRL), 3, b
#define FLTR4                            BANKMASK(ADFLTRL), 4, b
#define FLTR5                            BANKMASK(ADFLTRL), 5, b
#define FLTR6                            BANKMASK(ADFLTRL), 6, b
#define FLTR7                            BANKMASK(ADFLTRL), 7, b
#define FLTR8                            BANKMASK(ADFLTRH), 0, b
#define FLTR9                            BANKMASK(ADFLTRH), 1, b
#define FM0                              BANKMASK(ADCON0), 2, b
#define FREE                             BANKMASK(NVMCON1), 4, b
#define FRQ0                             BANKMASK(OSCFRQ), 0, b
#define FRQ1                             BANKMASK(OSCFRQ), 1, b
#define FRQ2                             BANKMASK(OSCFRQ), 2, b
#define FRQ3                             BANKMASK(OSCFRQ), 3, b
#define FST                              BANKMASK(SPI1CON1), 4, b
#define FULL                             BANKMASK(CRCCON0), 0, b
#define FVREN                            BANKMASK(FVRCON), 7, b
#define FVRMD                            BANKMASK(PMD0), 6, b
#define FVRRDY                           BANKMASK(FVRCON), 6, b
#define G1EN                             BANKMASK(CWG1CON0), 7, b
#define G2EN                             BANKMASK(CWG2CON0), 7, b
#define G3EN                             BANKMASK(CWG3CON0), 7, b
#define GIE                              BANKMASK(INTCON0), 7, a
#define GIEH                             BANKMASK(INTCON0), 7, a
#define GIEL                             BANKMASK(INTCON0), 6, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 0, b
#define GO_nDONE                         BANKMASK(ADCON0), 0, b
#define HADR0                            BANKMASK(SCANHADRL), 0, b
#define HADR1                            BANKMASK(SCANHADRL), 1, b
#define HADR10                           BANKMASK(SCANHADRH), 2, b
#define HADR11                           BANKMASK(SCANHADRH), 3, b
#define HADR12                           BANKMASK(SCANHADRH), 4, b
#define HADR13                           BANKMASK(SCANHADRH), 5, b
#define HADR14                           BANKMASK(SCANHADRH), 6, b
#define HADR15                           BANKMASK(SCANHADRH), 7, b
#define HADR16                           BANKMASK(SCANHADRU), 0, b
#define HADR17                           BANKMASK(SCANHADRU), 1, b
#define HADR18                           BANKMASK(SCANHADRU), 2, b
#define HADR19                           BANKMASK(SCANHADRU), 3, b
#define HADR2                            BANKMASK(SCANHADRL), 2, b
#define HADR20                           BANKMASK(SCANHADRU), 4, b
#define HADR21                           BANKMASK(SCANHADRU), 5, b
#define HADR3                            BANKMASK(SCANHADRL), 3, b
#define HADR4                            BANKMASK(SCANHADRL), 4, b
#define HADR5                            BANKMASK(SCANHADRL), 5, b
#define HADR6                            BANKMASK(SCANHADRL), 6, b
#define HADR7                            BANKMASK(SCANHADRL), 7, b
#define HADR8                            BANKMASK(SCANHADRH), 0, b
#define HADR9                            BANKMASK(SCANHADRH), 1, b
#define HFFRQ0                           BANKMASK(OSCFRQ), 0, b
#define HFFRQ1                           BANKMASK(OSCFRQ), 1, b
#define HFFRQ2                           BANKMASK(OSCFRQ), 2, b
#define HFFRQ3                           BANKMASK(OSCFRQ), 3, b
#define HFOEN                            BANKMASK(OSCEN), 6, b
#define HFOR                             BANKMASK(OSCSTAT), 6, b
#define HFTUN0                           BANKMASK(OSCTUNE), 0, b
#define HFTUN1                           BANKMASK(OSCTUNE), 1, b
#define HFTUN2                           BANKMASK(OSCTUNE), 2, b
#define HFTUN3                           BANKMASK(OSCTUNE), 3, b
#define HFTUN4                           BANKMASK(OSCTUNE), 4, b
#define HFTUN5                           BANKMASK(OSCTUNE), 5, b
#define HLVDEN                           BANKMASK(HLVDCON0), 7, b
#define HLVDIE                           BANKMASK(PIE0), 1, b
#define HLVDIF                           BANKMASK(PIR0), 1, b
#define HLVDINTH                         BANKMASK(HLVDCON0), 1, b
#define HLVDINTL                         BANKMASK(HLVDCON0), 0, b
#define HLVDIP                           BANKMASK(IPR0), 1, b
#define HLVDMD                           BANKMASK(PMD0), 5, b
#define HLVDOUT                          BANKMASK(HLVDCON0), 5, b
#define HLVDRDY                          BANKMASK(HLVDCON0), 4, b
#define HLVDSEL0                         BANKMASK(HLVDCON1), 0, b
#define HLVDSEL1                         BANKMASK(HLVDCON1), 1, b
#define HLVDSEL2                         BANKMASK(HLVDCON1), 2, b
#define HLVDSEL3                         BANKMASK(HLVDCON1), 3, b
#define I2C1EIE                          BANKMASK(PIE3), 2, b
#define I2C1EIF                          BANKMASK(PIR3), 2, b
#define I2C1EIP                          BANKMASK(IPR3), 2, b
#define I2C1IE                           BANKMASK(PIE3), 1, b
#define I2C1IF                           BANKMASK(PIR3), 1, b
#define I2C1IP                           BANKMASK(IPR3), 1, b
#define I2C1MD                           BANKMASK(PMD5), 0, b
#define I2C1RXIE                         BANKMASK(PIE2), 7, b
#define I2C1RXIF                         BANKMASK(PIR2), 7, b
#define I2C1RXIP                         BANKMASK(IPR2), 7, b
#define I2C1TXIE                         BANKMASK(PIE3), 0, b
#define I2C1TXIF                         BANKMASK(PIR3), 0, b
#define I2C1TXIP                         BANKMASK(IPR3), 0, b
#define I2C2EIE                          BANKMASK(PIE6), 1, b
#define I2C2EIF                          BANKMASK(PIR6), 1, b
#define I2C2EIP                          BANKMASK(IPR6), 1, b
#define I2C2IE                           BANKMASK(PIE6), 0, b
#define I2C2IF                           BANKMASK(PIR6), 0, b
#define I2C2IP                           BANKMASK(IPR6), 0, b
#define I2C2MD                           BANKMASK(PMD5), 1, b
#define I2C2RXIE                         BANKMASK(PIE5), 6, b
#define I2C2RXIF                         BANKMASK(PIR5), 6, b
#define I2C2RXIP                         BANKMASK(IPR5), 6, b
#define I2C2TXIE                         BANKMASK(PIE5), 7, b
#define I2C2TXIF                         BANKMASK(PIR5), 7, b
#define I2C2TXIP                         BANKMASK(IPR5), 7, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, b
#define INC0                             BANKMASK(NCO1INCL), 0, b
#define INC1                             BANKMASK(NCO1INCL), 1, b
#define INC10                            BANKMASK(NCO1INCH), 2, b
#define INC11                            BANKMASK(NCO1INCH), 3, b
#define INC12                            BANKMASK(NCO1INCH), 4, b
#define INC13                            BANKMASK(NCO1INCH), 5, b
#define INC14                            BANKMASK(NCO1INCH), 6, b
#define INC15                            BANKMASK(NCO1INCH), 7, b
#define INC16                            BANKMASK(NCO1INCU), 0, b
#define INC17                            BANKMASK(NCO1INCU), 1, b
#define INC18                            BANKMASK(NCO1INCU), 2, b
#define INC19                            BANKMASK(NCO1INCU), 3, b
#define INC2                             BANKMASK(NCO1INCL), 2, b
#define INC3                             BANKMASK(NCO1INCL), 3, b
#define INC4                             BANKMASK(NCO1INCL), 4, b
#define INC5                             BANKMASK(NCO1INCL), 5, b
#define INC6                             BANKMASK(NCO1INCL), 6, b
#define INC7                             BANKMASK(NCO1INCL), 7, b
#define INC8                             BANKMASK(NCO1INCH), 0, b
#define INC9                             BANKMASK(NCO1INCH), 1, b
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON0), 0, a
#define INT0IE                           BANKMASK(PIE1), 0, b
#define INT0IF                           BANKMASK(PIR1), 0, b
#define INT0IP                           BANKMASK(IPR1), 0, b
#define INT1EDG                          BANKMASK(INTCON0), 1, a
#define INT1IE                           BANKMASK(PIE5), 0, b
#define INT1IF                           BANKMASK(PIR5), 0, b
#define INT1IP                           BANKMASK(IPR5), 0, b
#define INT2EDG                          BANKMASK(INTCON0), 2, a
#define INT2IE                           BANKMASK(PIE7), 5, b
#define INT2IF                           BANKMASK(PIR7), 5, b
#define INT2IP                           BANKMASK(IPR7), 5, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
